filecloud/app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = 2
---
  def index
    # @categories = Category.all

    @search =Category.search(params[:search])
    @categories = @search.paginate(:per_page => 10, :page => params[:page])


  # @search =Category.search(params[:search])
  #   @categories = @search.paginate(:per_page => 2, :page => params[:page])

    if current_user.has_role? :admin
      @categories=Category.all

    else


    @categories=Category.where(:user_id=>current_user.id)

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @search = Category.search(params[:search])
    @categories = @search.paginate(:per_page => 10, :page => params[:page])

    @categories=Category.where(:user_id=>current_user.id)

INSERT INTO "categories" ("created_at", "description", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 05 Feb 2013 04:09:57 UTC +00:00], ["description", "ok every body"], ["name", "Anh trien lam"], ["updated_at", Tue, 05 Feb 2013 04:09:57 UTC +00:00], ["user_id", 1]]
---
  def create
     # binding.pry
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "categories" SET "name" = 'thanh vien vang, bac', "updated_at" = '2013-02-05 08:46:24.279231' WHERE "categories"."id" = 1
---
  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])