filecloud/app/controllers/folders_controller.rb

  def index
    if Folder.root.nil?
      @folder = Folder.new(:name => 'Root folder')
      @folder.save
---
INSERT INTO "folders" ("category_id", "created_at", "name", "parent_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["category_id", 1], ["created_at", Tue, 05 Feb 2013 08:03:31 UTC +00:00], ["name", "Root folder"], ["parent_id", nil], ["updated_at", Tue, 05 Feb 2013 08:03:31 UTC +00:00]]