filecloud/app/controllers/folders_controller.rb

  def show
  	@folder=Folder.find(params[:id])
    @subFolders=Folder.where(:parentId => @folder.id)

    @files = @folder.file_up_loads.search(params[:search]).order(sort_column + " " + sort_direction).paginate(:per_page => 5, :page => params[:page])
---
SELECT "folders".* FROM "folders" WHERE "folders"."id" = ? LIMIT 1  [["id", "show"]]
SELECT "folders".* FROM "folders" WHERE "folders"."parent_id" = 1 ORDER BY name
SELECT "user_files".* FROM "user_files" WHERE "user_files"."folder_id" = 1 ORDER BY attachment_file_name

  def new
    @parentId=params[:Fparent]
    @folder=Folder.new
    if !@parentId
     @categorys=Category.all
    else
      folder=Folder.find(@parentId)
---
SELECT "folders".* FROM "folders" WHERE "folders"."id" = ? LIMIT 1  [["id", "1"]]

  def create
  	@folder=Folder.new(params[:folder])
    if @folder.save
---
INSERT INTO "folders" ("category_id", "created_at", "name", "parent_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["category_id", nil], ["created_at", Tue, 05 Feb 2013 08:31:03 UTC +00:00], ["name", "Qua tet cua Admin"], ["parent_id", 1], ["updated_at", Tue, 05 Feb 2013 08:31:03 UTC +00:00]]