filecloud/app/controllers/share_links_controller.rb

  def create
    @share_link = @file.share_links.build(params[:share_link])

    if @share_link.save
---
INSERT INTO "share_links" ("created_at", "emails", "link_expires_at", "link_token", "updated_at", "user_file_id") VALUES (?, ?, ?, ?, ?, ?)