filecloud/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (name IS NOT NULL) ORDER BY name
SELECT COUNT(*) FROM "users" WHERE (name IS NULL)
---
  def index
     # @users = User.search(params[:search]).paginate(:per_page => 5, :page => params[:page])
      @users = User.search(params[:search]).order(sort_column + " " + sort_direction).paginate(:per_page => 5, :page => params[:page])

INSERT INTO "users" ("attach_content_type", "attach_file_name", "attach_file_size", "attach_updated_at", "created_at", "email", "hashed_password", "is_admin", "name", "password_salt", "pic_content_type", "pic_file_name", "pic_file_size", "pic_updated_at", "remember_token", "reset_password_token", "reset_password_token_expires_at", "signup_token", "signup_token_expires_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    if !User.find_by_email(@user.email)
      @activation_code=SecureRandom.urlsafe_base64
      @user.login=@activation_code
      respond_to do |format|
        if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "pic_file_name" = 'facebook.png', "pic_content_type" = 'image/png', "pic_file_size" = 227, "pic_updated_at" = '2013-02-05 06:41:47.211905', "password_salt" = 'qxbtPJyXNYCZMGVXVak5TY1pS4xgPNZS+j0wEq3XDDI=', "hashed_password" = 'bcd272a65b5d02d4ee88fb9e7fde6ea06338c619ce606c8fd55752bf2465b70f', "updated_at" = '2013-02-05 06:41:47.789922' WHERE "users"."id" = 1
---
  def update
    @user = User.find(params[:id])
    respond_to do |format|
    if @user.update_attributes(params[:user])