filecloud/app/views/permissions/_form.html.erb

SELECT "permissions".* FROM "permissions" WHERE "permissions"."folder_id" = 1
---
    <% reset_cycle -%>
    <% @folder.permissions.each do |permission| -%>

SELECT "groups".* FROM "groups" WHERE "groups"."id" = 1 LIMIT 1
---
        <tr class="<%= cycle('even','odd') %>">
          <% if permission.group.admins_group? -%>