filecloud/app/views/users/_form.html.erb

      <span class="user_groups">
        <% Group.all.each do |group| -%>
---
SELECT "groups".* FROM "groups"