filecloud/app/views/folders/show.html.erb

	 <%= hidden_field_tag :page, :value => params[:page] %>
		<% if Folder.where(:user_id => current_user, :id => params[:id]).exists? %>
---
SELECT "folders".* FROM "folders" WHERE "folders"."id" = ? LIMIT 1  [["id", "1"]]